#### FieldValues Members

---

|  |
| --- |
| FieldValues Class   Constructors   Methods   Properties   See Also |

The  FieldValues  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FieldValues(FieldValues) | Creates a copy of the given FieldValues instance. |
| Public method | FieldValues(IList ValueAtPoint ) | Creates object from an array of domain point values |
| Public method | FieldValues(IList VectorAtPoint ) | Creates object from an array of domain point vectors |
| Public method | FieldValues(IList ValueAtPoint , XYZ) | Creates object from an array of domain point values |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FieldValues |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FieldValues Class

Autodesk.Revit.DB.Analysis Namespace